{
  "profile": {
    "name": {
      "firstName": "Wesley",
      "lastName": "Chiang",
      "nickName": "Wes"
    },
    "title": "Lead Software Engineer",
    "contact": {
      "email": "westhechiang@gmail.com",
      "github": "https://bit.ly/2zrvjiH",
      "linkedIn": "https://bit.ly/2xOviUK",
      "city": "Cypress Park, CA"
    },
    "summary": {
      "highlight": "I'm a leader who is passionate about building happy productive teams and writing scaleable & maintainable code",
      "details": [
        "A quick learner with experience in vetting and working with new technologies to find the best solutions to problems",
        "A strong team player and comfortable with taking on leadership roles",
        "Business-minded and know how to prioritize projects and tasks to maximize benefits to the organization",
        "Accountable; I execute quickly and with high quality; I identify bottlenecks, resolve them, and keep projects moving forward"
      ]
    },
    "skills": {
      "languages": [
        "JavaScript / Typescript",
        "Terraform",
        "CSS/SASS",
        "APEX",
        "Visualforce"
      ],
      "database": ["PostgreSQL", "MySQL"],
      "technologies": [
        "Apollo",
        "AI",
        "AWS",
        "Docker",
        "Gatsby",
        "GraphQL",
        "Jamstack",
        "Netlify",
        "Node",
        "NX",
        "React",
        "Salesforce",
        "Serverless",
        "Twilio",
        "Webpack"
      ],
      "hobbies": [
        "Camping",
        "Cooking",
        "Gardening",
        "Welding",
        "Mycology",
        "Plant Tissue Culture",
        "Hydroponics",
        "Woodworking",
        "Vermicomposting",
        "3D Printing",
        "3D Modeling"
      ]
    }
  },
  "projects": [
    {
      "name": "Personal Garden Hydroponics",
      "notes": "In a collaborative venture with my wife, we purchased an 8000 sq. ft. lot and embarked on transforming it into an urban farm-to-table event space. At the heart of our project is the garden, where I designed and implemented a hydroponics system, responsible for growing our produce for events. This system is driven by a Raspberry Pi, which I programmed to provide real-time control, monitoring, and optimization of the growing conditions. This digital farm management not only ensures the quality and freshness of our produce, but also encapsulates our vision of integrating technology and sustainability in urban agriculture."
    },
    {
      "name": "Mama's Gotchu",
      "url": "https://app.mamasgotchu.com",
      "notes": "When COVID19 hit, my chef friends had to shutter their catering business. To survive, they started doing meal deliveries. Operations and customer management was a nightmare and so I led a team of 3 engineers to build out a kitchen operations management web application for them. At its peak we had 60+ customers and regularly delivered ~130 meals every week! Built with Typescript, React, Twilio, Apollo (GraphQL) and Serverless."
    }
  ],
  "experience": [
    {
      "id": 0,
      "title": "Engineering Manager - Foundational Technologies (Platform)",
      "location": "Culver City, CA",
      "company": "Sweetgreen",
      "duration": {
        "start": "06/2023",
        "end": "Current"
      },
      "accomplishments": [
        "Hired 2 Software Engineers, 1 L5 and 1 L6 to join our platform team. Promoted the L5 to L6 after 8 months of joining the team and has been a key contributor to the team's success.",
        "Oversaw the migration of our CI platform from CircleCI to Github Actions, which significantly reduced our CI costs and increased our velocity.",
        "Brokered relationships between Engineering and Security + Retail Tech, helping to align on priorities and goals. In addition to supporting our software engineers, Foundational Technology also supports the Security and Retail Tech teams.",
        "AWS, Datadog, and Github owner for Sweetgreen's AWS account, responsible for all resources and costs.",
        "Responsible for all SRE, DX, Infrastructure, and Monorepo (NX) efforts for Sweetgreen.",
        "Introduced and rolled out CursorAI to the entire engineering team, which increased developer productivity by 30%."
      ]
    },
    {
      "id": 1,
      "title": "Lead Software Engineer - Foundational Technologies (Platform)",
      "location": "Culver City, CA",
      "company": "Sweetgreen",
      "duration": {
        "start": "05/2022",
        "end": "06/2023"
      },
      "accomplishments": [
        "Developed a proof-of-concept that demonstrated the potential for utilizing a CRM for managing operations at Sweetgreen, ultimately convincing leadership to adopt the platform. Currently leading the migration efforts",
        "Collaborated with management to identify and address spikes in engineering resource costs (e.g. AWS, CircleCI, Datadog), successfully reducing costs by ~30% while maintaining the same level of developer experience.",
        "Conduct regular workshops to educate engineers on best practices and to introduce new features released by the Foundational Tech team, fostering a culture of continuous learning and improvement. A recent example includes a session on End-to-End (E2E) testing using the Playwright framework, showing engineers how to write tests that simulate user interactions with our application, and how these tests can be run in parallel to reduce test execution time from 2 hours to 10 minutes."
      ]
    },
    {
      "id": 2,
      "title": "Sr. Software Engineer",
      "location": "Culver City, CA",
      "company": "Sweetgreen",
      "duration": {
        "start": "08/2020",
        "end": "05/2022"
      },
      "accomplishments": [
        "Recognized the inefficiencies of having ~300 GitHub repositories and developers working in silos; proposed and led the transition to a monorepo using the NX framework, resulting in a significant increase in engineering velocity and enabling ~10 releases per day, up from once a month. The move to the monorepo also had a significant cultural impact as it was instrumental in helping the engineering team stay positive, productive and collaborative during a turbulent time.",
        "Led the 'replatforming' initiative at Sweetgreen, transitioning from native development (iOS / Android) and the Ember web framework to React Native over a period of ~1 year. This transition not only yielded massive productivity gains for developers but also drastically improved our customer's experience, as evidenced by our Android app rating improving from 1 star to 5 stars in the Google Play Store.",
        "Utilizing the Serverless framework, extracted the most heavily used API, location search, from our monolith backend into its own service. This dramatically reduced latency times for customers searching for a Sweetgreen location, significantly enhancing the customer experience."
      ]
    },
    {
      "id": 3,
      "title": "Lead Software Engineer",
      "location": "Downtown Los Angeles, CA",
      "company": "Tubescience",
      "duration": {
        "start": "06/2019",
        "end": "08/2022"
      },
      "accomplishments": [
        "Worked with leadership to define engineering and product roadmap. Ran sprint planning, backlog grooming, gathered requirements and wrote tickets. Grew engineering team by leading hiring and establishing engineering best practices.",
        "Led the development of internal insights web application (built with React, Typescript, and GraphQL) that was pivotal in empowering Creative Strategists to find and replicate top performing ads, which increased client retention and spending; leveraged Hasura to generate a GraphQL endpoint from an existing Postgres infrastructure, exposing Facebook data for the web application to consume.",
        "Introduced and trained engineers in React, GraphQL, Typescript, and Test Driven Development.",
        "Established automated CI/CD pipeline using CircleCI with full end-to-end testing using Cypress.io; increased velocity from 1 deploy a week to ~8 - 10 a week."
      ]
    },
    {
      "id": 4,
      "title": "Lead Software Engineer",
      "location": "Downtown Los Angeles, CA",
      "company": "Tubescience",
      "duration": {
        "start": "06/2019",
        "end": "Current"
      },
      "accomplishments": [
        "Worked with leadership to define engineering and product roadmap. Ran sprint planning, backlog grooming, gathered requirements and wrote tickets. Grew engineering team by leading hiring and establishing engineering best practices.",
        "Led the development of internal insights web application (built with React, Typescript, and GraphQL) that was pivotal in empowering Creative Strategists to find and replicate top performing ads, which increased client retention and spending; leveraged Hasura to generate a GraphQL endpoint from an existing Postgres infrastructure, exposing Facebook data for the web application to consume.",
        "Introduced and trained engineers in React, GraphQL, Typescript, and Test Driven Development.",
        "Established automated CI/CD pipeline using CircleCI with full end-to-end testing using Cypress.io; increased velocity from 1 deploy a week to ~8 - 10 a week."
      ]
    },
    {
      "id": 5,
      "title": "Lead Software Engineer",
      "location": "West Hollywood, CA",
      "company": "Wag!",
      "duration": {
        "start": "12/2018",
        "end": "06/2019"
      },
      "accomplishments": [
        "Led a team of 5 engineers; defined web engineering code and process standards; improved communication across NorCal and SoCal web engineering teams",
        "Improved release velocity while reducing number of bugs released to production; averaging 10 releases per week, up from ~3 per week",
        "Built the web team 'canary' test suite; ensures back end changes do not adversely affect endpoints the web team uses by automatically testing endpoints and alerting the team of breaking changes",
        "Led the migration from legacy Django web application (wagwalking.com) to GatsbyJS; drastically improving SEO and page performance reducing page load time by more than 300%",
        "Created Wag!'s shared React Component library using React, Styled Components, Styled System, and Lerna with over 80 components and counting"
      ]
    },
    {
      "id": 6,
      "title": "Full Stack Engineer",
      "location": "West Hollywood, CA",
      "company": "Wag!",
      "duration": {
        "start": "07/2018",
        "end": "12/2018"
      },
      "accomplishments": [
        "Identified opportunities for web team to help iOS and Android teams to meet release expectations; built out MVP features in React to create webviews for Wag! mobile applications",
        "Completely re-architected legacy React web app, drastically improving stability and customer experience (0 downtime since re-architecture); migrated back end off of Firebase",
        "Built out entire suite of end-to-end tests with Cypress.io for legacy web app",
        "Built out entire CI pipeline in GitLab to facilitate test automation; spins up a local instance of wagWebApp and wagAPI via Docker and runs entire suite of tests. Increased developer confidence and awareness by integrating pipeline results with Slack"
      ]
    },
    {
      "id": 7,
      "title": "Full Stack Engineer",
      "location": "Los Angeles, CA",
      "company": "RealtyMogul.com",
      "duration": {
        "start": "01/2017",
        "end": "07/2018"
      },
      "accomplishments": [
        "Designed and built a suite of microservices that ingests and normalizes 3rd party data from multiple sources, and RESTful API's for user interfaces built in React to interact with",
        "Templatize the creation of microservices using Cookiecutter in order to maximize consistency and efficiency",
        "Managed the evaluation of various open source front-end technologies, ultimately implementing and training a team of 7 engineers on React, Redux, Redux-Saga, and Styled-Components",
        "Worked closely with in-house designers to create and maintain RealtyMogul.com's core UI component library using Storybook; maximizing code reuse, consistency, and team efficiency",
        "Established front-end coding standards and best practices such as Test Driven Development; implemented linters and tests that were automatically run on code commit, which prevented failing code from being introduced to the code base and ultimately, fewer bugs for QA",
        "Overhauled front-end tooling / build system, decreasing front-end code compile time from 10s to ~0.2s and drastically improving developer experience"
      ]
    },
    {
      "id": 8,
      "title": "Salesforce Technical Architect",
      "location": "Los Angeles, CA",
      "company": "RealtyMogul.com",
      "duration": {
        "start": "02/2015",
        "end": "01/2017"
      },
      "accomplishments": [
        "Gathered requirements across multiple cross-functional business orgs; completely re-implemented RealtyMogul.com's Salesforce instance with Custom Objects, and custom APEX code to better match their unique business requirements",
        "Established Salesforce.com development and administration best practices to ensure long-term maintainability and ease of customization",
        "Resolved system-wide synchronization failures between Drupal and Salesforce and improved site performance and reliability by migrating all data synchronizations from synchronous to asynchronous",
        "Built custom GUI for Salesforce Administrators to better control, monitor, and manage the synchronization of data between Drupal and Salesforce",
        "Built custom Round Robin lead distribution system which randomly and fairly assigned new leads across 4 sales teams and over 20 sales representatives; also implemented an administrative interface for Salesforce admins to add and modifying lead distribution rules without requiring dev resources or additional deployments"
      ]
    }
  ],
  "education": {
    "school": "UC Berkeley",
    "duration": "2008 - 2011",
    "location": "Berkeley, CA",
    "degree": "BA, Political Economics"
  }
}
